In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Display top3 rows of dataset

## Check last 3 rows of dataset

## Find shape of dataset

## get info of dataset

## Check null values in dataset

## Get overall statistics about dataframe

## find unique values from gender column

## number of unique values from gender column

## display count of unique values in gender column

## Find total num of students having marks between 90and 100(inclusive) using between method and without using between method

## Find average marks

## Apply method

## Map function

## Drop the columns

## Print name of columns

## Sort the df as per th